###################### Root ######################
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "beeftornado/rmtree"

###### Fonts ######
cask "font-hack-nerd-font"

###### Coding Stuff ######
## Term/Editor ##
brew "tmux"
brew "git-delta"
brew "neovim"
cask "wezterm"

## Shell ##
brew "starship"
brew "direnv"
brew "tree"

## Command Line ## 
brew "gh"
brew "wget"

## Apps ##
cask "docker"
cask "gitkraken"
cask "fig"

## Build Stuff/Deps##
brew "make"
brew "pinentry-mac"
brew "openssl@3"
brew "gnutls"
brew "gnupg"
brew "libev"
brew "ripgrep"


###### Personal Apps ######
## Social ##
cask "discord"

## Rando ##
cask "obsidian"
cask "betterdisplay"
brew "bitwarden-cli"

## Browsers ##
cask "google-chrome"
cask "firefox"

## Music Stuff ##
cask "spotify"
cask "qobuz"
cask "soundsource"

###################### Personal ######################
tap "supabase/tap"

###### Languages ######
## Postgres ##
brew "libpq"

## Lua ##
brew "lua"
brew "lua-language-server"

## Go ##
brew "go"

## OCaml ##
brew "opam"

## JSON ##
brew "jq"

## Swift ##
brew "swiftformat"

## Node ##
brew "node"

###################### Work Shared ######################
## Apps ##
cask "zoom"
cask "slack"

###################### Voze ######################
## Apps ##
cask "clickup"
cask "1password"
